The network needs an input or output element to perform the calculation.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId NetworkErrorElementWithDownUpStreamNode { get; }
  Visual Basic
Public Shared ReadOnly Property NetworkErrorElementWithDownUpStreamNode As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NetworkErrorElementWithDownUpStreamNode {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPCalculationFailures Class
  Autodesk.Revit.DB Namespace